rheoTool/tutorials/rheoInterFoam/DieSwell/CarreauYasuda/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
      parameters
       {		        
                type            CarreauYasuda;
                
                rho             rho   [1 -3 0 0 0 0 0] .03;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 1e6; 
   		etaInf          etaInf  [ 1 -1 -1 0 0 0 0 ] 1e-3; 
   		k               k     [ 0 0 1 0 0 0 0 ] 1.389495494e7; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.3;   
   		a               a     [ 0 0 0 0 0 0 0 ] 2;
       }
}

air
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1.5e-4;
         eta             eta [1 -1 -1 0 0 0 0] 1e-3;
       }
}
 

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.;

// ************************************************************************* //
